# pipe sizes from Dy
Pipe = {'15': '20x2.5', '20': '25x2.5', '25': '30x3', '32': '42x3', '40': '45x3', '50': '57x3.5', '65': '76x4',
        '80': '89x4.5',
        '100': '108x4.5', '125': '133x4.5', '150': '159x5', '175': '194x6', '200': '219x7', '225': '245x8',
        '250': '273x8',
        '300': '325x8', '350': '377x10', '400': '426x10', '500': '530x10', '600': 'не по ГОСТу',
        '700': 'не по ГОСТу',
        '800': 'не по ГОСТу'}
# Dy data index in json
table_index = {'15': 0, '20': 1, '25': 2, '32': 3, '40': 4, '50': 5, '65': 6, '80': 7, '100': 8, '125': 9, '150': 10,
            '175': 11, '200': 12, '225': 13, '250': 14, '300': 15, '350': 16, '400': 17, '500': 18, '600':19,
            '700': 20, '800': 21}


# class add data in comboBoxes
class window_data():

    def send_data_on_the_window(ui):
        Flange_GOST = ("12820-80 (плоские)","12821-80 (сапожковие)")
        ui.comboBox_GOST.addItems(Flange_GOST)

        Py_for_box = ("0,1;0,25 МПа", "0.6 МПа", "1.0 МПа", "1.6 МПа", "2.5 МПа")
        ui.comboBox_Py.addItems(Py_for_box)

        Dy_for_box = (
        '15', '20', '25', '32', '40', '50', '65', '80', '100', '125', '150', '175', '200', '225', '250', '300', '350',
        '400', '500', '600', '700', '800')
        ui.comboBox_Dy.addItems(Dy_for_box)

        Type_Flange = ('1', '2', '3')
        ui.comboBox_4.addItems((Type_Flange))

        Counter_Flange = ("Ответный", "Заглушка", "Нет")
        ui.comboBox_3.addItems(Counter_Flange)